УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовЗакупки/ЖурналДокументовЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="be6c7627-3a81-434a-bccf-007a451c8959">
  <name>ЖурналДокументовЗакупки</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиДляПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПервогоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаВозвратнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаПредоплатыДоПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаАвансаДоПодтверждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПроводитьДокументПриВысокомСПАРКРиске</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветственныйЗаСПАРКРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартПредзаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="690a0f93-be8f-4a32-8881-57f1d122fbb8">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыГрафикаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ЖурналДокументовЗакупки/Forms/ФормаПодбораТоваровИзЗаказа/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	смартДобавитьЭлементыПрограммно();
	
	//подтянем из заказа данные контейнера
	СтруктураПоискаБезСерии = Новый Структура("Номенклатура, Характеристика, КодСтроки, ЗаказПоставщику, Склад");
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.ТаблицаТоваров Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоискаБезСерии, СтрокаТаблицы);	
		СтрокаТаблицы.смартКонтейнер = смартПолучитьСтрокуКонтейнераНаСервере(СтруктураПоискаБезСерии);
	КонецЦикла;	
КонецПроцедуры//--#1374 смарт: Балашов 21.06.2023

#КонецОбласти

#Область ДоработкиСмарт 

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартДобавитьЭлементыПрограммно()

	МассивДобавляемыхРеквизитов = Новый Массив;
	Реквизит_Контейнер = Новый РеквизитФормы("смартКонтейнер", Новый ОписаниеТипов("Строка"),"ТаблицаТоваров", "смартКонтейнер");
	МассивДобавляемыхРеквизитов.Добавить(Реквизит_Контейнер); 

	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	НоваяКолонка = Элементы.Добавить("смартКонтейнер", Тип("ПолеФормы"), Элементы.ТаблицаТоваров); 
	НоваяКолонка.Заголовок = "смартКонтейнер"; 
	НоваяКолонка.ПутьКДанным = "ТаблицаТоваров.смартКонтейнер"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
	НоваяКолонка.АвтоВысотаЯчейки = истина; 

КонецПроцедуры//--#1374 смарт: Балашов 21.06.2023

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартПолучитьСтрокуКонтейнераНаСервере(СтруктураПоискаБезСерии)
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ Ссылка, смартКонтейнер, Ссылка.Груз, Номенклатура 
		|ИЗ Документ.ЗаказПоставщику.Товары КАК ЗПТ 
		|ГДЕ 
		|	Ссылка = &ЗаказПоставщику 
		|	И Номенклатура = &Номенклатура
		|	И КодСтроки = &КодСтроки
		|	И Склад = &Склад
		|	И Характеристика = &Характеристика";                  
	ПараметрыЗапроса = Запрос.НайтиПараметры(); 
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Имя, СтруктураПоискаБезСерии[ПараметрЗапроса.Имя]);
	КонецЦикла;	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатЗапроса = Выборка.смартКонтейнер;
		//проверим полученный результат на возможность использования в документе
		Заказ = Выборка.Ссылка;
		Номенклатура = Выборка.Номенклатура;
		Груз = Выборка.Груз;
		Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
			МассивКонтейнеров = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(РезультатЗапроса);
			Если ТипЗнч(МассивКонтейнеров) = Тип("Массив") Тогда
				Для Каждого Контейнер Из МассивКонтейнеров Цикл
					НовыйGUID = Новый УникальныйИдентификатор(Контейнер.Ссылка);
					СсылкаКонтейнер = Справочники.смартКонтейнеры.ПолучитьСсылку(НовыйGUID);
					КЗаполению = смартПроверитьКонтейнерДляЗаполнения(Заказ, Номенклатура, Груз, СсылкаКонтейнер); 
					Если Не КЗаполению или Не Контейнер.Пометка Тогда
						МассивКонтейнеров.Удалить(МассивКонтейнеров.Найти(Контейнер));
					КонецЕсли;	
				КонецЦикла;	
				Если МассивКонтейнеров.Количество() > 0 Тогда
					РезультатЗапроса = смартОбщегоНазначения.смартЗаписатьВыбраныеКонтейнерыВJSON(МассивКонтейнеров);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	Иначе
		РезультатЗапроса = "";
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции//--#1374 смарт: Балашов 21.06.2023

//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
Функция смартПроверитьКонтейнерДляЗаполнения(Заказ, Номенклатура, Груз, Контейнер)
	Результат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	смартГрузыКОформлениюОстатки.Заказ КАК Заказ,
		|	смартГрузыКОформлениюОстатки.Номенклатура КАК Номенклатура,
		|	смартГрузыКОформлениюОстатки.Груз КАК Груз,
		|	смартГрузыКОформлениюОстатки.Контейнер КАК Контейнер,
		|	смартГрузыКОформлениюОстатки.КОформлениюОстаток КАК КОформлениюОстаток,
		|	смартГрузыКОформлениюОстатки.КПриемкеОстаток КАК КПриемкеОстаток
		|ИЗ
		|	РегистрНакопления.смартГрузыКОформлению.Остатки КАК смартГрузыКОформлениюОстатки
		|ГДЕ
		|	смартГрузыКОформлениюОстатки.Заказ = &Заказ
		|	И смартГрузыКОформлениюОстатки.Номенклатура = &Номенклатура
		|	И смартГрузыКОформлениюОстатки.Груз = &Груз
		|	И смартГрузыКОформлениюОстатки.Контейнер = &Контейнер	
		|	";
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Груз",Груз);
	Запрос.УстановитьПараметр("Контейнер",Контейнер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КОформлениюОстаток;
	КонецЕсли;	
	Возврат Результат;
КонецФункции//--#1374 смарт: Балашов 21.06.2023

#КонецОбласти
